; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v5 ?v6)
             (pred_1 ?v3 ?v13)
             (pred_6 ?v5 ?v13)
             (pred_3 ?v2 ?v5 )
	     (pred_4 ?v5)
             (pred_5 ?v1)
             (pred_12 ?v3)
             (pred_10 ?v13)
             (pred_2 ?v5)
             (pred_9 ?v3)
             (pred_11 ?v5)
             (pred_8 ))



(:action op_5
:parameters (?v10 ?v11 ?v4 ?v9)
:precondition (and (pred_5 ?v10) (pred_5 ?v11) (pred_12 ?v4) (pred_10 ?v9)
          (pred_7 ?v10 ?v11) (pred_1 ?v4 ?v9)
                   (pred_6 ?v11 ?v9) (pred_4 ?v10) 
                   (pred_2 ?v11) (pred_9 ?v4))
:effect (and  (pred_11 ?v11) (not (pred_2 ?v11))))


(:action op_3
:parameters (?v10 ?v7)
:precondition (and (pred_5 ?v10) (pred_5 ?v7)
               (pred_4 ?v10) (pred_7 ?v10 ?v7) (pred_11 ?v7))
:effect (and (pred_4 ?v7) (not (pred_4 ?v10))))

(:action op_4
:parameters (?v10 ?v4)
:precondition (and (pred_5 ?v10) (pred_12 ?v4) 
                  (pred_4 ?v10) (pred_3 ?v4 ?v10) (pred_8 ))
:effect (and (pred_9 ?v4)
   (not (pred_3 ?v4 ?v10)) (not (pred_8 ))))


(:action op_1
:parameters (?v10 ?v8 ?v12)
:precondition (and (pred_5 ?v10) (pred_12 ?v8) (pred_12 ?v12)
                  (pred_4 ?v10) (pred_9 ?v12) (pred_3 ?v8 ?v10))
:effect (and (pred_9 ?v8) (pred_3 ?v12 ?v10)
        (not (pred_9 ?v12)) (not (pred_3 ?v8 ?v10))))

(:action op_2
:parameters (?v10 ?v4)
:precondition (and (pred_5 ?v10) (pred_12 ?v4) 
                  (pred_4 ?v10) (pred_9 ?v4))
:effect (and (pred_8 ) (pred_3 ?v4 ?v10) (not (pred_9 ?v4)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_09 obj_17 obj_05 obj_15 obj_13 obj_29 obj_25 obj_22 obj_30 obj_02 obj_03 obj_11 obj_12 obj_14 obj_01 obj_24 obj_04 obj_23 obj_18 obj_19 obj_27 obj_21 obj_16 obj_28 obj_20
    obj_10 obj_08 obj_31
    obj_26 obj_07 obj_06
    )

    (:init
       (pred_8)

       (pred_5 obj_09)
       (pred_5 obj_17)
       (pred_5 obj_05)
       (pred_5 obj_15)
       (pred_5 obj_13)
       (pred_5 obj_29)
       (pred_5 obj_25)
       (pred_5 obj_22)
       (pred_5 obj_30)
       (pred_5 obj_02)
       (pred_5 obj_03)
       (pred_5 obj_11)
       (pred_5 obj_12)
       (pred_5 obj_14)
       (pred_5 obj_01)
       (pred_5 obj_24)
       (pred_5 obj_04)
       (pred_5 obj_23)
       (pred_5 obj_18)
       (pred_5 obj_19)
       (pred_5 obj_27)
       (pred_5 obj_21)
       (pred_5 obj_16)
       (pred_5 obj_28)
       (pred_5 obj_20)
       (pred_10 obj_10)
       (pred_10 obj_08)
       (pred_10 obj_31)
       (pred_12 obj_26)
       (pred_12 obj_07)
       (pred_12 obj_06)

       (pred_7 obj_09 obj_29)
       (pred_7 obj_09 obj_17)
       (pred_7 obj_17 obj_25)
       (pred_7 obj_17 obj_05)
       (pred_7 obj_17 obj_09)
       (pred_7 obj_05 obj_22)
       (pred_7 obj_05 obj_15)
       (pred_7 obj_05 obj_17)
       (pred_7 obj_15 obj_30)
       (pred_7 obj_15 obj_13)
       (pred_7 obj_15 obj_05)
       (pred_7 obj_13 obj_02)
       (pred_7 obj_13 obj_15)
       (pred_7 obj_29 obj_03)
       (pred_7 obj_29 obj_25)
       (pred_7 obj_29 obj_09)
       (pred_7 obj_25 obj_11)
       (pred_7 obj_25 obj_22)
       (pred_7 obj_25 obj_17)
       (pred_7 obj_25 obj_29)
       (pred_7 obj_22 obj_12)
       (pred_7 obj_22 obj_30)
       (pred_7 obj_22 obj_05)
       (pred_7 obj_22 obj_25)
       (pred_7 obj_30 obj_14)
       (pred_7 obj_30 obj_02)
       (pred_7 obj_30 obj_15)
       (pred_7 obj_30 obj_22)
       (pred_7 obj_02 obj_01)
       (pred_7 obj_02 obj_13)
       (pred_7 obj_02 obj_30)
       (pred_7 obj_03 obj_24)
       (pred_7 obj_03 obj_11)
       (pred_7 obj_03 obj_29)
       (pred_7 obj_11 obj_04)
       (pred_7 obj_11 obj_12)
       (pred_7 obj_11 obj_25)
       (pred_7 obj_11 obj_03)
       (pred_7 obj_12 obj_23)
       (pred_7 obj_12 obj_14)
       (pred_7 obj_12 obj_22)
       (pred_7 obj_12 obj_11)
       (pred_7 obj_14 obj_18)
       (pred_7 obj_14 obj_01)
       (pred_7 obj_14 obj_30)
       (pred_7 obj_14 obj_12)
       (pred_7 obj_01 obj_19)
       (pred_7 obj_01 obj_02)
       (pred_7 obj_01 obj_14)
       (pred_7 obj_24 obj_27)
       (pred_7 obj_24 obj_04)
       (pred_7 obj_24 obj_03)
       (pred_7 obj_04 obj_21)
       (pred_7 obj_04 obj_23)
       (pred_7 obj_04 obj_11)
       (pred_7 obj_04 obj_24)
       (pred_7 obj_23 obj_16)
       (pred_7 obj_23 obj_18)
       (pred_7 obj_23 obj_12)
       (pred_7 obj_23 obj_04)
       (pred_7 obj_18 obj_28)
       (pred_7 obj_18 obj_19)
       (pred_7 obj_18 obj_14)
       (pred_7 obj_18 obj_23)
       (pred_7 obj_19 obj_20)
       (pred_7 obj_19 obj_01)
       (pred_7 obj_19 obj_18)
       (pred_7 obj_27 obj_21)
       (pred_7 obj_27 obj_24)
       (pred_7 obj_21 obj_16)
       (pred_7 obj_21 obj_04)
       (pred_7 obj_21 obj_27)
       (pred_7 obj_16 obj_28)
       (pred_7 obj_16 obj_23)
       (pred_7 obj_16 obj_21)
       (pred_7 obj_28 obj_20)
       (pred_7 obj_28 obj_18)
       (pred_7 obj_28 obj_16)
       (pred_7 obj_20 obj_19)
       (pred_7 obj_20 obj_28)
       (pred_2 obj_20)
       (pred_2 obj_30)
       (pred_2 obj_23)
       (pred_6  obj_20 obj_10)
       (pred_6  obj_30 obj_08)
       (pred_6  obj_23 obj_31)
       (pred_11 obj_09)
       (pred_11 obj_17)
       (pred_11 obj_05)
       (pred_11 obj_15)
       (pred_11 obj_13)
       (pred_11 obj_29)
       (pred_11 obj_25)
       (pred_11 obj_22)
       (pred_11 obj_02)
       (pred_11 obj_03)
       (pred_11 obj_11)
       (pred_11 obj_12)
       (pred_11 obj_14)
       (pred_11 obj_01)
       (pred_11 obj_24)
       (pred_11 obj_04)
       (pred_11 obj_18)
       (pred_11 obj_19)
       (pred_11 obj_27)
       (pred_11 obj_21)
       (pred_11 obj_16)
       (pred_11 obj_28)

       (pred_1  obj_26 obj_10)
       (pred_1  obj_07 obj_08)
       (pred_1  obj_06 obj_31)
       (pred_3 obj_26 obj_19)
       (pred_3 obj_07 obj_04)
       (pred_3 obj_06 obj_03)
       (pred_4 obj_16)
    )

    (:goal (and
       (pred_3 obj_07 obj_09)
       (pred_3 obj_06 obj_21)
    ))
(:constraints
  (always (not (pred_4 obj_11)))
)
)

; plan
1. (op_3 obj_16 obj_21)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_21)
   goals met: 0 of 2
2. (op_3 obj_21 obj_27)
   deleted: (pred_4 obj_21)
   added: (pred_4 obj_27)
   goals met: 0 of 2
3. (op_3 obj_27 obj_24)
   deleted: (pred_4 obj_27)
   added: (pred_4 obj_24)
   goals met: 0 of 2
4. (op_3 obj_24 obj_03)
   deleted: (pred_4 obj_24)
   added: (pred_4 obj_03)
   goals met: 0 of 2
5. (op_4 obj_03 obj_06)
   deleted: (pred_3 obj_06 obj_03) (pred_8)
   added: (pred_9 obj_06)
   goals met: 0 of 2
6. (op_3 obj_03 obj_24)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_24)
   goals met: 0 of 2
7. (op_3 obj_24 obj_04)
   deleted: (pred_4 obj_24)
   added: (pred_4 obj_04)
   goals met: 0 of 2
8. (op_3 obj_04 obj_21)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_21)
   goals met: 0 of 2
9. (op_2 obj_21 obj_06)
   deleted: (pred_9 obj_06)
   added: (pred_8) (pred_3 obj_06 obj_21)
   goals met: 1 of 2
10. (op_3 obj_21 obj_04)
   deleted: (pred_4 obj_21)
   added: (pred_4 obj_04)
   goals met: 1 of 2
11. (op_4 obj_04 obj_07)
   deleted: (pred_3 obj_07 obj_04) (pred_8)
   added: (pred_9 obj_07)
   goals met: 1 of 2
12. (op_3 obj_04 obj_24)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_24)
   goals met: 1 of 2
13. (op_3 obj_24 obj_03)
   deleted: (pred_4 obj_24)
   added: (pred_4 obj_03)
   goals met: 1 of 2
14. (op_3 obj_03 obj_29)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_29)
   goals met: 1 of 2
15. (op_3 obj_29 obj_09)
   deleted: (pred_4 obj_29)
   added: (pred_4 obj_09)
   goals met: 1 of 2
16. (op_2 obj_09 obj_07)
   deleted: (pred_9 obj_07)
   added: (pred_8) (pred_3 obj_07 obj_09)
   goals met: 2 of 2
